---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.NumberForScale
source: html/68cb7547-8297-c341-e26f-3e6307247c6c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.NumberForScale Property

A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically).

## Syntax (C#)
```csharp
public double NumberForScale { get; set; }
```